<!DOCTYPE html>
<html lang="en-US">
<meta charset="UTF-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />

<head>
<title>A Discussion on the Intercalation Rule in the Qin and Early Han Dynasties</title>
<link rel="stylesheet" href="calendar.css">
<script src="header.js"></script>
</head>
    
<body  onload="header(0,'')">
<div id="wrapper0">
<div id="menu"></div>
<h2 style="text-align:right;"><a href="QinHanCalIntercalation_chinese.html">Chinese &#x4E2D;&#x6587;</a></h2>
    
<h1>A Discussion on the Intercalation Rule in the Qin and Early Han Dynasties (221 BCE &ndash; 104 BCE)</h1>
 
   
<br />
    <hr />
<h2>References</h2>

<ul style="list-style-type:none;">
<li id="CC78a"><p>[<span class="ref">CC78a</span>] Ch&#233;n, Ji&#468;j&#299;n (&#38515;&#20037;&#37329;) and Ch&#233;n, M&#283;id&#333;ng (&#38515;&#32654;&#26481;), "L&#237;ny&#237; ch&#363; t&#468; H&#224;n ch&#363; g&#468; l&#236; ch&#363; t&#224;n" (临沂出土汉初古历初探 or "A first study on the excavated calendar table in the early Han dynasty from Linyi"), in <i>Zh&#333;ng Gu&#243; Ti&#257;n W&#233;n Xu&#233; Sh&#464; W&#233;n J&#237;</i> (&#12298;&#20013;&#22269;&#22825;&#25991;&#23398;&#21490;&#25991;&#38598;&#12299; or <i>A Collection of Essays on the History of Chinese Astronomy</i>),  Science Press (Beijing), April 1978, pp. 66&ndash;81.</li>   
    
<li id="CC78b"><p>[<span class="ref">CC78b</span>] Ch&#233;n, Ji&#468;j&#299;n (&#38515;&#20037;&#37329;) and Ch&#233;n, M&#283;id&#333;ng (&#38515;&#32654;&#26481;), "C&#243;ng yu&#225;n gu&#257;ng l&#236; p&#468; j&#237; M&#462;w&#225;ngdu&#299; b&#243; sh&#363; W&#468;x&#299;ngzh&#257;n de ch&#363; t&#468; z&#224;i t&#224;n Zhu&#257;nx&#363; l&#236; de w&#232;n t&#237;" (从元光历谱及马王堆帛书《五星占》的出土再探颛顼历的问题 or "A re-investigation of the issues on the Zhuanxu calendar from the excavated calendar table in 134 BCE and from <i>Wuxingzhan</i> (<i>Prognostics of the five planets</i>) recovered from Mawangdui"), in <i>Zh&#333;ng Gu&#243; Ti&#257;n W&#233;n Xu&#233; Sh&#464; W&#233;n J&#237;</i> (&#12298;&#20013;&#22269;&#22825;&#25991;&#23398;&#21490;&#25991;&#38598;&#12299; or <i>A Collection of Essays on the History of Chinese Astronomy</i>),  Science Press (Beijing), April 1978, pp. 95&ndash;117.</li>   

<li id="Li2009"><p>[<span class="ref">Li09</span>] L&#464;, Zh&#333;ngl&#237;n (李忠林), "On the Intercalary Method of the Calendar System of Qin and Early Han Dynasties" (试论秦汉初历法的置闰规则), <i>Journal of Sichuan University (Social Science Edition)</i> (四川大学学报(哲学社会科学版)), No. 6, 2009 (Sum No. 165), pp. 5&ndash;11.</li>
    
<li id="Li2012"><p>[<span class="ref">Li12</span>] L&#464;, Zh&#333;ngl&#237;n (李忠林), "Q&#237;n zh&#236; H&#224;n ch&#363; (qi&#225;n 246 zh&#236; qi&#225;n 104) l&#236; f&#462; y&#225;n ji&#363; &mdash; y&#464; ch&#363; t&#468; l&#236; ji&#462;n w&#233;i zh&#333;ng x&#299;n" 秦至汉初(前246至前104)历法研究&mdash;以出土历简为中心 or "Researches on Calendars from Qin to early Han (246 B.C. to 104 B.C.) &mdash; centering on excavated calendrical bamboo slips"), in <i>Zh&#333;ng g&#243;o sh&#464; y&#225;n ji&#363;</i> (《中国史研究》 or <i>Studies in Chinese History</i>), issue no. 2, pp. 17&ndash;69 (2012).</p></li>
    
<li id="Zhang1978"><p>[<span class="ref">Zhang78</span>] Zh&#257;ng, P&#233;iy&#250; (張培瑜), "H&#224;n ch&#363; l&#236; f&#462; t&#462;o l&#249;n" (汉初历法讨论 or "On the calendar system in the early Han dynasty"), in <i>Zh&#333;ng Gu&#243; Ti&#257;n W&#233;n Xu&#233; Sh&#464; W&#233;n J&#237;</i> (&#12298;&#20013;&#22269;&#22825;&#25991;&#23398;&#21490;&#25991;&#38598;&#12299; or <i>A Collection of Essays on the History of Chinese Astronomy</i>),  Science Press (Beijing), April 1978, pp. 82&ndash;94.</p></li>
    
<li id="Zhang1997"><p>[<span class="ref">Zhang97</span>] Zh&#257;ng, P&#233;iy&#250; (&#24373;&#22521;&#29788;),  <i>S&#257;nqi&#257;n W&#468;b&#462;ini&#462;n L&#236;r&#236; Ti&#257;nxi&#224;ng</i> (&#12298;&#19977;&#21315;&#20116;&#30334;&#24180;&#21382;&#26085;&#22825;&#35937;&#12299; or <i>3500 Years of Calendars and Astronomical Phenonena</i>), Elephant Press, July 1997.</p></li>
    
<li id="Zhang2007"><p>[<span class="ref">Zhang07</span>] Zh&#257;ng, P&#233;iy&#250; (張培瑜), "G&#275;n j&#249; x&#299;n ch&#363; l&#236; r&#236; ji&#462;n d&#250; sh&#236; l&#249;n Q&#237;n y&#468; H&#224;n ch&#363; de l&#236; f&#462;" (根据新出历日简牍试论秦与汉初的历法 or "An  Attempt  to Discuss  the  Calendrics  of  the  Qin  and  Early  Han  According  to Newly Excavated Calendars on Slips and Boards"), in <i>Zh&#333;ngyu&#225;n w&#233;nw&#249;</i> (《中原文物》 or <i>Culture relic in Central Plains China</i>), issue no. 5, pp. 62&ndash;77 (2007).</p></li>
    
<li id="ZCBH2008"><p>[<span class="ref">ZCBH08</span>] Zh&#257;ng, P&#233;iy&#250; (&#24373;&#22521;&#29788;), Ch&#233;n, M&#283;id&#333;ng (&#38515;&#32654;&#26481;), B&#243;, Sh&#249;r&#233;n (&#34180;&#27193;&#20154;), and H&#250;, Ti&#283;zh&#363; (&#32993;&#37941;&#29664;), <i>Zh&#333;ng Gu&#243; G&#468;d&#224;i L&#236;f&#462;</i> (&#12298;&#20013;&#22269;&#21476;&#20195;&#21382;&#27861;&#12299; or <i>Ancient Chinese Calendars and Almanacs</i>), China Science Press (Beijing), March 2008.</p></li>
</ul>
    
<br /><br />
    
</div><!-- end of wrapper -->

</body>
</html>