<!DOCTYPE html><html lang="en-US"><meta name="keywords" content="Chinese Calendar, Western Calendar, conversion"><meta charset="UTF-8"><meta name="viewport" content="width=device-width,initial-scale=1"><head><title>Chinese-Western Calendar Conversion Table</title><link rel="stylesheet" href="calendar_min.css"><script src="table_c.js"></script><base href="https://ytliu0.github.io/ChineseCalendar/"><script async src="https://www.googletagmanager.com/gtag/js?id=G-SN0QJRDXXT"></script><script>function gtag(){dataLayer.push(arguments)}window.dataLayer=window.dataLayer||[],gtag("js",new Date),gtag("config","G-SN0QJRDXXT")</script></head><body><div id="menu"></div><div id="language"></div><div id="title"></div><div id="returnMainMenu" style="display:none"><p><button class="return"><a href="table.html">Return to menu and choose another period</a></button></p><br></div><div id="Spring" style="display:none"><p>In the Spring and Autumn period (722 BCE &ndash; 481 BCE), China was divided into many states. Each state used its own calendar. In this period, we only have fragmented information about the calendar used by the Lu state from the chronicle <i>Chunqiu</i> revised by Confucius. This calendar is called Chunqiu here. The Chunqiu calendar here is reconstructed based on the information in Section 3.5 of the book <i>Zh&#333;ng Gu&#243; G&#468; D&#224;i L&#236; F&#462;</i> (&#12298;&#20013;&#22269;&#21476;&#20195;&#21382;&#27861;&#12299; or <i>Ancient Chinese Calendars and Almanacs</i>) written by Zh&#257;ng P&#233;iy&#250; (&#24373;&#22521;&#29788;), Ch&#233;n M&#283;id&#333;ng (&#38515;&#32654;&#26481;), B&#243; Sh&#249;r&#233;n (&#34180;&#27193;&#20154;), and H&#250; Ti&#283;zh&#363; (&#32993;&#37941;&#29664;), published by China Science Press (Beijing) in March 2008. Our computation method is explained on our <a href="chunqiu.html">Chunqiu Calendar page</a>.</p><p>In addition to the Chunqiu calendar, three calendars Zhou, Yin and Xia (three of the <i>g&#468;li&#249;l&#236;</i> or <i>ancient six calendars</i>) are also provided for reference, although it is believed that they were developed in a later period. The calendars in g&#468;li&#249;l&#236; here are reconstructed based on the information in Section 3.6 of the book <i>Ancient Chinese Calendars and Almanacs</i> mentioned above. Our computation method is explained on our <a href="guliuli.html">ancient six calendars page</a>.</p><p>The calendar that is currently shown is the <span id="calshownSpring"></span> calendar. You can select a different calendar by clicking one of the buttons below.</p><h3>Choose a calendar:</h3><p><button id="chunqiuSpring" class="calendars active" onclick='select_calendar_table("chunqiuSpring",0)'>Chunqiu</button> <button id="zhouSpring" class="calendars" onclick='select_calendar_table("zhouSpring",0)'>Zhou</button> <button id="yinSpring" class="calendars" onclick='select_calendar_table("yinSpring",0)'>Yin</button> <button id="xiaSpring" class="calendars" onclick='select_calendar_table("xiaSpring",0)'>Xia</button></p><br><p id="SpringliDescription" style="color:brown"></p><br></div><div id="Warring" style="display:none"><p>In the Warring States period (480 BCE &ndash; 222 BCE), China was divided into many states. Each state used its own calendar. It was believed that there were six versions of calendars used by the states at that time. They are collectively called g&#468;li&#249;l&#236; or ancient six calendars. These six calendars were Zhou, Lu, Huangdi, Yin, Xia and Zhuanxu. They were all based on a similar algorithm. However, the first month of a year was not the same. The epoch (used to specify the initial data for the lunar conjunction and winter solstice) used in each calendar was also different. The calendars in g&#468;li&#249;l&#236; here are reconstructed based on the information in Section 3.6 of the book <i>Zh&#333;ng Gu&#243; G&#468; D&#224;i L&#236; F&#462;</i> (&#12298;&#20013;&#22269;&#21476;&#20195;&#21382;&#27861;&#12299; or <i>Ancient Chinese Calendars and Almanacs</i>) written by Zh&#257;ng P&#233;iy&#250; (&#24373;&#22521;&#29788;), Ch&#233;n M&#283;id&#333;ng (&#38515;&#32654;&#26481;), B&#243; Sh&#249;r&#233;n (&#34180;&#27193;&#20154;), and H&#250; Ti&#283;zh&#363; (&#32993;&#37941;&#29664;), published by China Science Press (Beijing) in March 2008. Our computation method is explained on our <a href="guliuli.html">ancient six calendars page</a>.</p><p>The calendar that is currently shown is the <span id="calshownWarring"></span> calendar. You can select a different calendar by clicking one of the buttons below.</p><h3>Choose a calendar from G&#468;li&#249;l&#236;:</h3><p><button id="zhouWarring" class="calendars active" onclick='select_calendar_table("zhouWarring",0)'>Zhou</button> <button id="luWarring" class="calendars" onclick='select_calendar_table("luWarring",0)'>Lu</button> <button id="huangdiWarring" class="calendars" onclick='select_calendar_table("huangdiWarring",0)'>Huangdi</button> <button id="yinWarring" class="calendars" onclick='select_calendar_table("yinWarring",0)'>Yin</button> <button id="xiaWarring" class="calendars" onclick='select_calendar_table("xiaWarring",0)'>Xia</button> <button id="zhuanxuWarring" class="calendars" onclick='select_calendar_table("zhuanxuWarring",0)'>Zhuanxu</button></p><br><p id="guliuliDescription" style="color:brown"></p><br></div><div id="description"></div><div id="table"></div><div id="returnMainMenuEnd" style="display:none"><p><button class="return"><a href="table.html">Return to menu and choose another period</a></button></p></div><br><br><noscript><h2>Oops!</h2><p>You must enable JavaScript to use this page.</p><p>Please enable JavaScript and reload.</p></noscript><script>init(0)</script></body></html>