<!DOCTYPE html>
<html lang="en-US">
<meta name="keywords" content="Chinese Calendar, Gregorian Calendar, conversion" />
<meta charset="UTF-8" />
<meta name="viewport" content="width=device-width, initial-scale=1">

<head>
<title>Conversion between Western and Chinese Calendar (722 BCE &mdash; 2200 CE)</title>
<link rel="stylesheet" href="calendar.css"> 
<script src="header.js"></script>
</head>

<body>

<div id="wrapper0" style="display:none;">    
<div id="menu"></div>
<div id="language"></div>

<h1>Conversion between Western and Chinese Calendar (722 BCE &mdash; 2200 CE)</h1>
    
<h3>Enter a year between -721 and 2200: <input type="number" id="year" step="1" min="-721" max="2200" />
&nbsp; &nbsp; 
<input type="button" value="Submit" id="myBtn" onClick="submitYear(0)" /></h3>
<p>(0 = 1 BCE, -1 = 2 BCE, -2 = 3 BCE and so on. BCE = before <a href="https://en.wikipedia.org/wiki/Common_Era" target="_blank">common era</a>, CE = common era.)</p>
    
<p>Julian dates at noon: <input id="Julian1" type="radio" name="true" value="1" onclick="showHideJulian(0,1)"><label for="Julian1">show</label> &nbsp;&nbsp;<input id="Julian0" type="radio" name="false" value="0" checked onclick="showHideJulian(0,0)"><label for="Julian0">don't show</label></p>

<p style="color:red;" id="err"></p>

<hr />
    <p><a href="index.html#explanation"><h4>Explanation of calendar table</h4></a></p>
<br />
    
<div id="Spring" style="display:none;">
<p style="color:brown;">In the Spring and Autumn period (722 BCE &ndash; 481 BCE), China was divided into many states. Each state used its own calendar. In this period, we only have fragmented information about the calendar used by the Lu state from the chronicle <i>Chunqiu</i> revised by Confucius. This calendar is called Chunqiu here. The Chunqiu calendar here is reconstructed based on the information in Section 3.5 of the book <i>Zh&#333;ng Gu&#243; G&#468; D&#224;i L&#236; F&#462;</i> (&#12298;&#20013;&#22269;&#21476;&#20195;&#21382;&#27861;&#12299; or <i>Ancient Chinese Calendars and Almanacs</i>) written by Zh&#257;ng P&#233;iy&#250; (&#24373;&#22521;&#29788;), Ch&#233;n M&#283;id&#333;ng (&#38515;&#32654;&#26481;), B&#243; Sh&#249;r&#233;n (&#34180;&#27193;&#20154;), and H&#250; Ti&#283;zh&#363; (&#32993;&#37941;&#29664;), published by China Science Press (Beijing) in March 2008. Our computation method is explained on our <a href="chunqiu.html">Chunqiu Calendar page</a>.</p> 

<p style="color:brown;">In addition to the Chunqiu calendar, three calendars Zhou, Yin and Xia (three of the <i>g&#468;li&#249;l&#236;</i> or <i>ancient six calendars</i>) are also provided for reference, although it is believed that they were developed in a later period. The calendars in g&#468;li&#249;l&#236; here are reconstructed based on the information in Section 3.6 of the book <i>Ancient Chinese Calendars and Almanacs</i> mentioned above. Our computation method is explained on our <a href="guliuli.html">ancient six calendars page</a>.</p>
    
<p style="color:brown;">The calendar that is currently shown is the <span id="calshownSpring"></span> calendar. You can select a different calendar by clicking one of the buttons below.</p>
    
<h3>Choose a calendar: </h3>
    <p> 
        <button id="chunqiuSpring" class="calendars active" onClick="select_calendar('chunqiuSpring',0)">Chunqiu</button>
        <button id="zhouSpring" class="calendars" onClick="select_calendar('zhouSpring',0)">Zhou</button>
        <button id="yinSpring" class="calendars" onClick="select_calendar('yinSpring',0)">Yin</button>
        <button id="xiaSpring" class="calendars" onClick="select_calendar('xiaSpring',0)">Xia</button>
    </p>
<br />
<p id="SpringliDescription" style="color:brown;"></p>
          <br />
</div>
    
<div id="Warring" style="display:none;">
<p style="color:brown;">In the Warring States period (480 BCE &ndash; 222 BCE), China was divided into many states. Each state used its own calendar. It was believed that there were six versions of calendars used by the states at that time. They are collectively called g&#468;li&#249;l&#236; or ancient six calendars. These six calendars were Zhou, Lu, Huangdi, Yin, Xia and Zhuanxu. They were all based on a similar algorithm. However, the first month of a year was not the same. The epoch (used to specify the initial data for the lunar conjunction and winter solstice) used in each calendar was also different. The calendars in g&#468;li&#249;l&#236; here are reconstructed based on the information in Section 3.6 of the book <i>Zh&#333;ng Gu&#243; G&#468; D&#224;i L&#236; F&#462;</i> (&#12298;&#20013;&#22269;&#21476;&#20195;&#21382;&#27861;&#12299; or <i>Ancient Chinese Calendars and Almanacs</i>) written by Zh&#257;ng P&#233;iy&#250; (&#24373;&#22521;&#29788;), Ch&#233;n M&#283;id&#333;ng (&#38515;&#32654;&#26481;), B&#243; Sh&#249;r&#233;n (&#34180;&#27193;&#20154;), and H&#250; Ti&#283;zh&#363; (&#32993;&#37941;&#29664;), published by China Science Press (Beijing) in March 2008. Our computation method is explained on our <a href="guliuli.html">ancient six calendars page</a>.</p>
    
<p style="color:brown;">The calendar that is currently shown is the <span id="calshownWarring"></span> calendar. You can select a different calendar by clicking one of the buttons below.</p>
    
<h3>Choose a calendar from G&#468;li&#249;l&#236;: </h3>
    <p> 
        <button id="zhouWarring" class="calendars active" onClick="select_calendar('zhouWarring',0)">Zhou</button>
        <button id="luWarring" class="calendars" onClick="select_calendar('luWarring',0)">Lu</button>
        <button id="huangdiWarring" class="calendars" onClick="select_calendar('huangdiWarring',0)">Huangdi</button>
        <button id="yinWarring" class="calendars" onClick="select_calendar('yinWarring',0)">Yin</button>
        <button id="xiaWarring" class="calendars" onClick="select_calendar('xiaWarring',0)">Xia</button>
        <button id="zhuanxuWarring" class="calendars" onClick="select_calendar('zhuanxuWarring',0)">Zhuanxu</button>
    </p>
<br />
<p id="guliuliDescription" style="color:brown;"></p>
          <br />
</div>
    
<div id="ThreeKingdoms" style="display:none;">
<p>Currently shown dynasty is <span id='TkiDynasty' style='background-color:#ffb3b3;'></span>. Click a button below to choose a different dynasty.</p>
<h3><button id="TkiWei" class="calendars active" onClick="select_calendar_split('TkiWei',0)">Wei</button>
    <button id="TkiShu" class="calendars" onClick="select_calendar_split('TkiShu',0)">Shu</button>
    <button id="TkiWu" class="calendars" onClick="select_calendar_split('TkiWu',0)">Wu</button>
    </h3>
    <br />
<h3><a href="ThreeKingdoms_calendars.html">Calendar Differences in the Three Kingdoms Period</a></h3><br /><br />
</div>
    
<div id="SouthNorth" style="display:none;">
<p>Currently shown dyansty is <span id='SN1Dynasty' style='background-color:#ffb3b3;'></span>. Click a button below to choose a different dynasty.</p>
<h3><button id="SN1South" class="calendars active" onClick="select_calendar_split('SN1South',0)">Jin</button>
    <button id="SN1LaterQin" class="calendars" onClick="select_calendar_split('SN1LaterQin',0)">Later Qin</button>
    <button id="SN1NorthernLiang" class="calendars" onClick="select_calendar_split('SN1NorthernLiang',0)">Northern Liang</button>
    <button id="SN1WeiZhouSui" class="calendars" onClick="select_calendar_split('SN1WeiZhouSui',0)">Northern Wei</button>
    <button id="SN1WeiQi" class="calendars" onClick="select_calendar_split('SN1WeiQi',0)">Eastern Wei</button>
    </h3>
    <br />
<h3><a href="NorthSouth_calendars.html">Calendar Differences in 398-589</a></h3><br /><br />
</div>
    
<div id="SongLiaoJinYuan" style="display:none;">
<p>Currently shown dyansty is <span id='SN2Dynasty' style='background-color:#ffb3b3;'></span>. Click a button below to choose a different dynasty.</p>
<h3><button id="SN2South" class="calendars active" onClick="select_calendar_split('SN2South',0)">Song</button>
<button id="SN2North" class="calendars" onClick="select_calendar_split('SN2North',0)">Jin</button>
    </h3>
    <br />
<h3><a href="LiaoJinYuan_calendars.html">Calendar Differences in 947-1279</a></h3><br /><br />
</div>

<div id="QingSouthernMing" style="display:none;">
<p>Currently shown dynasty is <span id="SN3Dynasty" style='background-color:#ffb3b3;'></span>. Click a button below to choose a different dynasty.</p>
<h3><button id="SN3North" class="calendars active" onClick="select_calendar_split('SN3North',0)">Qing</button>
    <button id="SN3South" class="calendars" onClick="select_calendar_split('SN3South',0)">Southern Ming</button>
</h3>
        <br />
<h3><a href="QingSouthernMingZheng_calendars.html">Calendar Differences in 1645-1683</a></h3><br /><br />
</div>

<div id="calendar">

</div>

<hr />
<br />    
<h2 id="explanation">Explanation</h2>
    
<p>The information in the calendar table is explained in the diagram below. The example is taken from January, 2017.</p>
    
<p><img src="calendarEngLegend.png" alt="diagram explaining the information in the calendar table" /></p>
    
<p>The month and date in the Chinese calendar is denoted by MM-DD in the calendar table. For example, 12-29 means the 29th day in the 12th month of the Chinese calendar. A Chinese year usually has 12 months. Each month can have 30 days (long month) or 29 days (short month). To keep the calendar in sync with seasons, a leap (intercalary) month is added about every three years so that the year has 13 months. A leap month works in a similar way as a leap day in the Gregorian calendar, but an extra month is inserted in the year instead of an extra day. The leap month is indicated by the same number as the previous month, but a "leap" is added before the number. For example, there was a leap month after month 6 in the Chinese year in 2017. The month is denoted by "leap 6".</p>
    
<p>A Chinese year is labelled by its sexagenary year cycle. Sexagenary cycle is also used to label the month and date in the Chinese calendar. Sexagenary month cycles are rarely used and they are provided only after 105 BCE. A brief introduction to the sexagenary cycle is given on <a href="sexagenary.html">this page</a>.</p>
    
<p>For simplicity, the symbols Q0, Q1, Q2 and Q3 are used to represent "new moon", "first quarter", "full moon" and "third quarter". At the bottom of each month, the Gregorian/Julian dates of the four moon phases and 24 solar terms occurring in the month are listed. The times are given in the China standard time (meridians of 120&deg; East). A brief introduction to the 24 solar terms is given on <a href="solarTerms.html">this page</a>.</p>
    
<p>Solar and lunar eclipses associated with the new moons and full moons are indicated with links to pages describing the eclipse circumstances. For more information about solar and lunar eclipses, visit my <a href="http://ytliu.epizy.com/eclipse/" target="_blank">Eight Millennia of Eclipses</a> website.</p>
    
<p><i>Calendrical solar terms</i> are listed for years before 1734. They refer to the 24 solar terms calculated according to the calendar at that time. They were defined by <i>p&#237;ngq&#236;</i> (i.e. the mean motion of the Sun) before 1645 and <i>d&#236;ngq&#236;</i> (i.e. the motion of the true Sun) in and after 1645. The 24 solar terms listed above these calendrical solar terms are based on the current definition (which is also based on <i>d&#236;ngq&#236;</i>) and are calculated by a modern method. Times are given in the China standard time (meridians of 120&deg; East). The difference between <i>p&#237;ngq&#236;</i> and <i>d&#236;ngq&#236;</i> is explained on our <a href="solarTerms.html">solar term page</a>. The dates of the calendrical solar terms after 1733 were mostly the same as the dates calculated using the modern method and therefore they are omitted, except when there were discrepancies.</p>
    
<p>Gregorian calendar is shown on Oct. 15, 1582 and afterwards. Julian calendar is shown before Oct. 15, 1582. <a href="https://en.wikipedia.org/wiki/Proleptic_Julian_calendar" target="_blank">Proleptic Julian calendar</a> is shown before 8 CE (CE = <a href="https://en.wikipedia.org/wiki/Common_Era" target="_blank">common era</a>).</p>
    
<p>Julian dates are the number of days and fractions counting from the time origin at noon on January 1, 4713 BCE (before common era). Hence Julian dates at noon are integers. A time zone is not specified here and it is assumed that the time origin (noon on January 1, 4713 BCE) and the time at noon on any day are both in the same time zone. Julian dates at noon will be shown at the bottom of each day if enabled. I also created the web-based <a href="Julian.html">Julian and sexagenary date calculator</a>.</p>
    
<p> You can enter the year using the URL query string "?y=[year]". For example, to show the calendar for 1850, use the (relative) URL <a href="index.html?y=1850">index.html?y=1850</a>. This won't work if the y parameter in the query string is not a number or is outside the range [-721, 2200].</p>
    
<p>The Chinese calendar on this website are computed using the methods described <a href="computation.html">here</a>.</p>
    
<br /><br />
</div> <!-- end of wrapper -->
    
<noscript>
<h1>Conversion between Western and Chinese Calendar (722 BCE &mdash; 2200 CE)</h1>
    
<h2>Oops!</h2>
<p>You must enable JavaScript to use this page.</p>
<p>Please enable JavaScript and reload. </p>
</noscript>
<script>init(0);</script>
</body>
</html>
