<!DOCTYPE html>
<html lang="en-US">
<meta name="keywords" content="Chinese Calendar, sexagenary cycle" />
<meta charset="UTF-8" />
<meta name="viewport" content="width=device-width, initial-scale=1">

<head>
<title>Sexagenary Cycle (&#20845;&#21313;&#24178;&#25903;)</title>
<link rel="stylesheet" href="calendar.css">
<script src="header.js"></script>
</head>

<body onload="header(0,'sexagenary','sexagenary')">
<div id="wrapper0">
<div id="menu"></div>
<div id="language"></div>

<h1>Sexagenary Cycle (&#20845;&#21313;&#24178;&#25903;)</h1>
    
<p>First draft: October 2018 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Last major update: July 7, 2019</p>

<br />    
<p>Sexagenary cycle is an ancient Chinese counting system that is still being used today. It consists of two Chinese characters. The first character is taken from one of the ten heavenly stems (&#22825;&#24178;) and the other from one of the twelve earthly branches (&#22320;&#25903;). Each of the twelve earthly branches is associated with an animal (see the table below).</p>
   <br /> 
<table id="stemsNbranches">
    <caption>Table 1: 10 heavenly stems and 12 earthly branches</caption>
<tr><td></td><th>Heavenly Stems</th> <td></td> <th colspan="2">Earthly Branches</th></tr>
    
<tr><td>1</td> <td>Ji&#462; (甲)</td> <td>1</td> <td>Z&#464; (子)</td> <td>Rat</td></tr>
    
<tr><td>2</td> <td>Y&#464; (乙)</td> <td>2</td> <td>Ch&#466;u (丑)</td> <td>Ox</td></tr>
    
<tr><td>3</td> <td>B&#464;ng (丙)</td> <td>3</td> <td>Y&#237;n (寅)</td> <td>Tiger</td></tr>
    
<tr><td>4</td> <td>D&#299;ng (丁)</td> <td>4</td> <td>M&#462;o (卯)</td> <td>Rabbit</td></tr>
    
<tr><td>5</td> <td>W&#249; (戊)</td> <td>5</td> <td>Ch&#233;n (辰)</td> <td>Dragon</td></tr>
    
<tr><td>6</td> <td>J&#464; (己)</td> <td>6</td> <td>S&#236; (巳)</td> <td>Snake</td></tr>
    
<tr><td>7</td> <td>G&#275;ng (庚)</td> <td>7</td> <td>W&#468; (午)</td> <td>Horse</td></tr>
    
<tr><td>8</td> <td>X&#299;n (辛)</td> <td>8</td> <td>W&#232;i (未)</td> <td>Goat</td></tr>
    
<tr><td>9</td> <td>R&#233;n (壬)</td> <td>9</td> <td>Sh&#275;n (申)</td> <td>Monkey</td></tr>
    
<tr><td>10</td> <td>Gu&#464; (癸)</td> <td>10</td> <td>Y&#466;u (酉)</td> <td>Chicken</td></tr>
    
<tr><td rowspan="2" colspan="2"></td> <td>11</td> <td>X&#363; (戌)</td> <td>Dog</td></tr>

<tr><td>12</td> <td>H&#224;i (亥)</td> <td>Pig</td></tr>
</table>
       <br />
<p>The counting starts with the number ji&#462; z&#464; (1,1), which is the first stem combined with the first branch. The next number is y&#464; ch&#466;u (2,2) &mdash; the second stem pairs with the second branch. It is followed by b&#464;ng y&#237;n (3,3) and so on up to gu&#464; y&#466;u (10,10). We are now running out of stems. The rule is to start from the beginning whenever we are running out of stems or branches, just like the numbers in clocks. So the numbers after gu&#464; y&#466;u are ji&#462; x&#363; (1,11), y&#464; h&#224;i (2,12), b&#464;ng z&#464; (3,1) and so on up to gu&#464; h&#224;i (10,12). The number after that is ji&#462; z&#464; (1,1) again and the cycle repeats. There are 60 numbers in a cycle, indicated in the table below.</p>
       <br />   
<!--
<div id="sexagenaryTable"></div>
<script>
let heavenEng = ["Ji&#462;","Y&#464;","B&#464;ng","D&#299;ng","W&#249;", 
                  "J&#464;", "G&#275;ng","X&#299;n","R&#233;n", "Gu&#464;"];
let earthEng = ["z&#464;", "ch&#466;u", "y&#237;n", "m&#462;o", "ch&#233;n", 
                "s&#236;", "w&#468;", "w&#232;i", "sh&#275;n", "y&#466;u", 
                "x&#363;", "h&#224;i"];
let heavenChi = ["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"];
let earthChi = ["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"];
// let txt = '<table>\n';
// for (let i=0; i<15; i++) {
//     txt += '<tr>\n';
//     for (let j=0; j<4; j++) {
//         let k = i+j*15;
//         let ih = (k % 10), ie = (k % 12);
//         txt += '<td>'+(k+1)+'</td><td>'+heavenChi[ih]+earthChi[ie]+'</td>\n';
//     }
//     txt += '</tr>\n';
// }
// txt += '</table>';
let txt = '<table>\n';
for (let i=0; i<20; i++) {
    txt += '<tr>\n';
    for (let j=0; j<3; j++) {
        let k = i+j*20;
        let ih = (k % 10), ie = (k % 12);
        txt +='<td>'+(k+1)+'</td><td>'+heavenEng[ih]+' '+earthEng[ie]+' ('+heavenChi[ih]+earthChi[ie]+')</td>\n';
    }
    txt += '</tr>\n';
}
txt += '</table>';
document.getElementById('sexagenaryTable').innerHTML = txt;
</script>
-->

<table id="sexagenary">
    <caption>Table 2: Sexagenary numbers</caption>
    <tr>
        <td>1</td><td>Jiǎ zǐ (甲子)</td>
        <td>21</td><td>Jiǎ shēn (甲申)</td>
        <td>41</td><td>Jiǎ chén (甲辰)</td>
        </tr>
        <tr>
        <td>2</td><td>Yǐ chǒu (乙丑)</td>
        <td>22</td><td>Yǐ yǒu (乙酉)</td>
        <td>42</td><td>Yǐ sì (乙巳)</td>
        </tr>
        <tr>
        <td>3</td><td>Bǐng yín (丙寅)</td>
        <td>23</td><td>Bǐng xū (丙戌)</td>
        <td>43</td><td>Bǐng wǔ (丙午)</td>
        </tr>
        <tr>
        <td>4</td><td>Dīng mǎo (丁卯)</td>
        <td>24</td><td>Dīng hài (丁亥)</td>
        <td>44</td><td>Dīng wèi (丁未)</td>
        </tr>
        <tr>
        <td>5</td><td>Wù chén (戊辰)</td>
        <td>25</td><td>Wù zǐ (戊子)</td>
        <td>45</td><td>Wù shēn (戊申)</td>
        </tr>
        <tr>
        <td>6</td><td>Jǐ sì (己巳)</td>
        <td>26</td><td>Jǐ chǒu (己丑)</td>
        <td>46</td><td>Jǐ yǒu (己酉)</td>
        </tr>
        <tr>
        <td>7</td><td>Gēng wǔ (庚午)</td>
        <td>27</td><td>Gēng yín (庚寅)</td>
        <td>47</td><td>Gēng xū (庚戌)</td>
        </tr>
        <tr>
        <td>8</td><td>Xīn wèi (辛未)</td>
        <td>28</td><td>Xīn mǎo (辛卯)</td>
        <td>48</td><td>Xīn hài (辛亥)</td>
        </tr>
        <tr>
        <td>9</td><td>Rén shēn (壬申)</td>
        <td>29</td><td>Rén chén (壬辰)</td>
        <td>49</td><td>Rén zǐ (壬子)</td>
        </tr>
        <tr>
        <td>10</td><td>Guǐ yǒu (癸酉)</td>
        <td>30</td><td>Guǐ sì (癸巳)</td>
        <td>50</td><td>Guǐ chǒu (癸丑)</td>
        </tr>
        <tr>
        <td>11</td><td>Jiǎ xū (甲戌)</td>
        <td>31</td><td>Jiǎ wǔ (甲午)</td>
        <td>51</td><td>Jiǎ yín (甲寅)</td>
        </tr>
        <tr>
        <td>12</td><td>Yǐ hài (乙亥)</td>
        <td>32</td><td>Yǐ wèi (乙未)</td>
        <td>52</td><td>Yǐ mǎo (乙卯)</td>
        </tr>
        <tr>
        <td>13</td><td>Bǐng zǐ (丙子)</td>
        <td>33</td><td>Bǐng shēn (丙申)</td>
        <td>53</td><td>Bǐng chén (丙辰)</td>
        </tr>
        <tr>
        <td>14</td><td>Dīng chǒu (丁丑)</td>
        <td>34</td><td>Dīng yǒu (丁酉)</td>
        <td>54</td><td>Dīng sì (丁巳)</td>
        </tr>
        <tr>
        <td>15</td><td>Wù yín (戊寅)</td>
        <td>35</td><td>Wù xū (戊戌)</td>
        <td>55</td><td>Wù wǔ (戊午)</td>
        </tr>
        <tr>
        <td>16</td><td>Jǐ mǎo (己卯)</td>
        <td>36</td><td>Jǐ hài (己亥)</td>
        <td>56</td><td>Jǐ wèi (己未)</td>
        </tr>
        <tr>
        <td>17</td><td>Gēng chén (庚辰)</td>
        <td>37</td><td>Gēng zǐ (庚子)</td>
        <td>57</td><td>Gēng shēn (庚申)</td>
        </tr>
        <tr>
        <td>18</td><td>Xīn sì (辛巳)</td>
        <td>38</td><td>Xīn chǒu (辛丑)</td>
        <td>58</td><td>Xīn yǒu (辛酉)</td>
        </tr>
        <tr>
        <td>19</td><td>Rén wǔ (壬午)</td>
        <td>39</td><td>Rén yín (壬寅)</td>
        <td>59</td><td>Rén xū (壬戌)</td>
        </tr>
        <tr>
        <td>20</td><td>Guǐ wèi (癸未)</td>
        <td>40</td><td>Guǐ mǎo (癸卯)</td>
        <td>60</td><td>Guǐ hài (癸亥)</td>
    </tr>
</table>

    <br />

<p>Because of the cyclic nature of the stems, branches and sexagenary numbers, Tables 1 and 2 are not the best way to list them. A better way to represent them is to arrange them in rings, as shown in the diagrams below.</p>

<p><img src="stems.png" alt="Heavenly Stem Diagram" style="max-width:100%;" />
    <img src="branches.png" alt="Earthly Branch Diagram" style="max-width:100%;" /></p>
<br />
<p><img src="sexagenary.png" alt="Sexagenary Cycle Diagram" style="max-width:100%;" /></p>
 <br />   
<p>It is apparent from these diagrams that each of the stems, branches, and sexagenary numbers is on an equal footing. The orders of the lists are somewhat arbitrary and are purely determined by conventions.</p>

<p>Sexagenary cycle is used to label years, months, days and times, although the cycle for months, days and time are no longer in common use today.</p>
<br />
<h2>Sexagenary Year Cycle</h2>
    
<p>Chinese years are usually labelled by its sexagenary cycle. They repeat every 60 years. The most recent cycle started in the Chinese year ji&#462; z&#464; in 1984.</p> 

<p>The sexagenary number of a Chinese year in a particular Western year can be computed easily using modular arithmetic. When I say a Chinese year in a particular Western year, I mean the Chinese year whose New Year day is closest to Jan. 1 in the Western year. For example, the Chinese year in 2018 refers to the year w&#249; x&#363; that begins on February 16, 2018 and ends on February 4, 2019.</p>
    
<p>From the cycles of the stems and branches and the fact that the year was ji&#462; z&#464; in 1984, it is easy to deduce that the stem number of a Chinese year in Western year y is 1 + mod(y+6, 10) and the branch number is 1 + mod(y+8, 12). Here mod(X,Y) denotes the remainder of X divided by Y. According to these formulae, the stem number of the Chinese year in 2018 is 5, which is w&#249;. The branch number is 11, which is x&#363;. So the sexagenary number of the year is w&#249; x&#363;.</p>
    
    <br />
<h2 id="jian"><i>Ji&#224;n</i> and the "Three Standards"</h2>
    
<p>The <i>ji&#224;n</i> (&#24314;) of a month refers to its branch name. A leap month does not have a branch name. Since there are only 12 regular months (not counting leap months) in a year, each month has its unique branch name. The (<i>ji&#224;n</i>) z&#464; month is defined as the month that contains the winter solstice. The ch&#466;u month is the regular month after the z&#464; month and so on. The z&#464; month is the present-day month 11, ch&#466;u month is month 12 and so on.</p>
    
<p>Legend has it that the first month of a year changed several times in the early periods of Chinese history. It was said that the y&#237;n month, the second regular month after the z&#464; month, was designated as the first month of a year in the Xia dynasty (c. 2000 BCE – c. 1600 BCE). It was switched to the ch&#466;u month in the Shang dynasty (c. 1600 BCE – c. 1046 BCE) and to the z&#464; month in the Zhou dynasty (c. 1046 BCE – 249 BCE). These three different numbering systems are called the "three standards" (&#19977;&#27491;). The Xia standard labels the y&#237;n month as month 1.  The Yin standard labels the ch&#466;u month as month 1 (Yin is another name for the Shang dynasty). The Zhou standard labels the z&#464; month as month 1.</p>
    
<p>It is now generally believed that the legend of three standards is not to be trusted. In the Warring States period (480 BCE &ndash; 222 BCE), China was divided into many states and each state used its own calendar. It is believed that there were mainly six calendars being used at that time. They are collectively called g&#468;li&#249;l&#236; (&#21476;&#20845;&#26310;) or <a href="guliuli.html">ancient six calendars</a>. These six calendars were Zhou, Lu, Huangdi, Yin, Xia and Zhuanxu. These calendars were all developed around the Warring States period, not in different earlier periods. The so-called three standards were simply the three different numbering systems used by the Zhou, Yin and Xia calendars. They were the three numbering systems used in different regions at that period, not numbering systems used in three earlier periods.</p>
    
<p>The calendar used in the Qin dynasty (221 BCE &ndash; 207 BCE) adopted the same numbering system as the Zhuanxu calendar. The first month was the h&#224;i month, but it was labelled as month 10 following the Xia standard. The numerical order of the months in a year was 10, 11, 12, 1, 2, ..., 9. When the Han dynasty was established in 206 BCE, the calendar system remained unchanged until 104 BCE when it was decided to follow the Xia standard to designate the y&#237;n month as the first month of a year. From then on, the y&#237;n month has been the first month most of the time, except during several short periods of time in which the Yin standard and Zhou standard were used. Hence the z&#464; month corresponds to month 11, ch&#466;u month is month 12, y&#237;n month is month 1, ..., and h&#224;i month is month 10.</p>
    
<p>Finally, I should mention that the term <i>ji&#224;n</i> means the handle of the big dipper asterism, which consists of the three stars Alkaid, Mizar and Alioth (see Figure 1 below). Directions may be labeled by the 12 earthly branches by dividing the horizon circle into 12 evenly spaced directions. The convention is to label the north direction by z&#464;, east by m&#462;o, south by w&#468;, west by y&#466;u and so on (see Figure 2 below). Before the 7th century, the big dipper stars were closer to the celestial north pole than today. They were always above the horizon as observed in the Central Plains China (around latitude 35&deg;N). They were circumpolar stars. In the evening around the winter solstice, the handle of the dipper pointed towards north (the z&#464; direction). That was the reason why the month containing the winter solstice was called the <i>ji&#224;n</i> z&#464; month. Because of the precession of Earth's spin axis, the dipper stars have moved further away from the celestial north pole. Today, in the evening around the winter solstice at 35&deg;N latitude, Alkaid is below the horizon; Mizar and Alioth are very low near the northern horizon. To see the dipper's handle pointing north, one has to travel to a region north of 41&deg;N.</p>
    
<p><figure>
    <img src="Dipper.png" alt="Big Dipper" style="max-width:100%;" />
    <figcaption>Figure 1: The Asterism of Big Dipper.</figcaption>
</figure>
<figure>
    <img src="direction_branch.png" alt="Earthly Branches and Directions" />
    <figcaption>Figure 2: Earthly Branches and Direction.</figcaption>
</figure>
</p>
    
<br />
<h2 id="sexagenaryMonths">Sexagenary Month Cycle</h2>
    
<p>Sexagenary month cycle is a bit tricky. According to this <a href="https://en.wikipedia.org/wiki/Sexagenary_cycle#Sexagenary_months" target="_blank">Wikipedia article</a>, there are two systems of sexagenary months. The first system is used in the <a href="index.html">calendar webpage</a>. In fact, the sexagenary month cycle was rarely used even in ancient historical records. It was mainly used by astrologers. The calendar page lists the sexagenary month cycle after 103 BCE. I include the discussion here for completeness.</p>
    <br />
<h3>System 1</h3>
    
<p>This system uses the Chinese months as the dividing line to label the month cycle. A leap month does not have its own sexagenary label. The sexagenary number in a leap month is the same as its preceding month. The branch of a month is its <i>ji&#224;n</i> name. When the branch of a month is paired with a stem, the sexagenary month cycle results and it repeats every 60 regular months, or five Chinese years. Since the stem name of a year repeats every 10 years, there is a 2-1 relationship between the stem name of a year and the stem name of each of the 12 months in the year. For example, the sexagenary number of the first month in the year of ji&#462; and j&#464; is always b&#464;ng y&#237;n, the second month is always d&#299;ng m&#462;o and so on. The following table lists the relationship.</p>
    <br />
<table>
<tr><th>Stem of a year</th> <th>Stem of the first month</th></tr>
<tr><td>Ji&#462;/J&#464; (&#x7532;/&#x5DF1;)</td> <td>B&#464;ng (&#x4E19;)</td></tr>
<tr><td>Y&#464;/G&#275;ng (&#x4E59;/&#x5E9A;)</td> <td>W&#249; (&#x620A;)</td></tr>
<tr><td>B&#464;ng/X&#299;n (&#x4E19;/&#x8F9B;)</td> <td>G&#275;ng (&#x5E9A;)</td></tr>
<tr><td>D&#299;ng/R&#233;n (&#x4E01;/&#x58EC;)</td> <td>R&#233;n (&#x58EC;)</td></tr>
<tr><td>W&#249;/Gu&#464; (&#x620A;/&#x7678;)</td> <td>Ji&#462; (&#x7532;)</td></tr>
</table>
    <br />
    
<p>With this table, it is easy to calculate the sexagenary number of any month in a Chinese year. As an example, let's see how the sexagenary number of the 5th regular month in the Chinese year in 2018 can be calculated. The sexagenary cycle of the year in 2018 is W&#249; x&#363;. It follows from the table that the stem of the first month is ji&#462;. The stem  of the 5th regular month is the 4th stem after ji&#462; in the list of heavenly stems, which is w&#249;. The branch name of month 5 is always w&#468;. Hence the sexagenary number of the 5th month in the year w&#249; x&#363; is w&#249; w&#468;. </p>
    
<p>In Chinese, a song was created as a mnemonic to help people memorize the table. However, I find it easier just to remember that the stem name of the first month of a ji&#462; year is b&#464;ng. The stem name of the other months can be deduced by counting the number of regular months from a ji&#462; year. For example, let's calculate the sexagenary number of the 5th (regular) month in the year w&#249; x&#363;. W&#249; is the fourth stem after ji&#462;, so the 5th month from a w&#249; year is the (5 + 12&times;4)th, or 53th regular month from a ji&#462; year. So its stem is mod(52, 10) or 2 stems after b&#464;ng, which is w&#249;. Hence the sexagenary number of the 5th month in the year w&#249; x&#363; is w&#249; w&#468;.</p>

<p>This system was used in the imperial calendars issued by the governments in the Ming and Qing dynasties. It's also used in modern calendars. As stated above, a leap month does not have a branch name. According to the rules in the imperial calendars in the Ming and Qing dynasties, two sexagenary month cycles were used in a leap month. A leap month does not contain a major solar term, but it has a minor solar term in the middle of the month. The rule was that the sexagenary month cycle of the previous month was used before the minor solar term and the month cycle of the following month was used after the minor solar term.</p>
<br />
    
<h3>System 2</h3>
    
<p>In this system, the month cycle is not associated with the calendrical month but with the minor solar terms (see the <a href="solarTerms.html">24 solar terms page</a> for an explanation of the 24 solar terms). The 24 solar terms are based entirely on the motion of the Sun, so it is a month system of a solar calendar. In ancient China, the period between two successive winter solstices was called a <i>su&#236;</i> (&#27506;), whereas the period between two successive Chinese New Year days was called a <i>ni&#225;n</i> (&#24180;). The concept of <i>su&#236;</i> is entirely based on the motion of the Sun. The length of a <i>su&#236;</i> is 365 days or 366 days with an average close to the tropical year (365.242 days). By contrast, <i>ni&#225;n</i> takes into account both the motion of the Sun and the phases of the Moon. The length of a <i>ni&#225;n</i> varies from about 354 days (normal years) to about 384 days (years with a leap month).</p>
    
<p>In this system, there are 12 months in a su&#236;, each month has approximately 30 or 31 days. The branch name of each month in a su&#236; is fixed. The month with branch name z&#464; is the period between the minor solar terms J11 (&#22823;&#38634;) and the day before J12 (&#23567;&#23506;). The month with branch name ch&#466;u is the period between J12 (&#23567;&#23506;) and the day before J1 (&#31435;&#26149;) and so on. The following table lists the periods of the 12 months, their approximate Chinese months, and their approximate dates in Gregorian calendar. In the table, J11&ndash;J12 means the period between J11 and the day before J12 and so on.</p>
    
<table>
<tr><th>Branch of the Month</th> <th>Period</th> <th>Approx. Chinese Month</th> <th>Approx. Gregorian Dates</th></tr>
<tr><td>Z&#464; (&#x5B50;)</td> <td>J11&ndash;J12 (&#22823;&#38634;&ndash;&#23567;&#23506;)</td> 
<td>Month 11</td> <td>Dec. 7 &ndash; Jan. 5</td></tr>
<tr><td>Ch&#466;u (&#x4E11;)</td> <td>J12&ndash;J1 (&#23567;&#23506;&ndash;&#31435;&#26149;)</td> 
<td>Month 12</td> <td>Jan. 6 &ndash; Feb. 3</td></tr>
<tr><td>Y&#237;n (&#x5BC5;)</td> <td>J1&ndash;J2 (&#31435;&#26149;&ndash;&#39514;&#34756;)</td> 
<td>Month 1</td> <td>Feb. 4 &ndash; Mar. 5</td></tr>
<tr><td>M&#462;o (&#x536F;)</td> <td>J2&ndash;J3 (&#39514;&#34756;&ndash;&#28165;&#26126;)</td> 
<td>Month 2</td> <td>Mar. 6 &ndash; Apr. 4</td></tr>
<tr><td>Ch&#233;n (&#x8FB0;)</td> <td>J3&ndash;J4 (&#28165;&#26126;&ndash;&#31435;&#22799;)</td> 
<td>Month 3</td> <td>Apr. 5 &ndash; May 5</td></tr>
<tr><td>S&#236; (&#x5DF3;)</td> <td>J4&ndash;J5 (&#31435;&#22799;&ndash;&#33426;&#31278;)</td> 
<td>Month 4</td> <td>May 6 &ndash; Jun. 5</td></tr>
<tr><td>W&#468; (&#x5348;)</td> <td>J5&ndash;J6 (&#33426;&#31278;&ndash;&#23567;&#26257;)</td> 
<td>Month 5</td> <td>Jun. 6 &ndash; Jul. 6</td></tr>
<tr><td>W&#232;i (&#x672A;)</td> <td>J6&ndash;J7 (&#23567;&#26257;&ndash;&#31435;&#31179;)</td> 
<td>Month 6</td> <td>Jul. 7 &ndash; Aug. 7</td></tr>
<tr><td>Sh&#275;n (&#x7533;)</td> <td>J7&ndash;J8 (&#31435;&#31179;&ndash;&#30333;&#38706;)</td> 
<td>Month 7</td> <td>Aug. 8 &ndash; Sep. 7</td></tr>
<tr><td>Y&#466;u (&#x9149;)</td> <td>J8&ndash;J9 (&#30333;&#38706;&ndash;&#23506;&#38706;)</td> 
<td>Month 8</td> <td>Sep. 8 &ndash; Oct. 7</td></tr>
<tr><td>X&#363; (&#x620C;)</td> <td>J9&ndash;J10 (&#23506;&#38706;&ndash;&#31435;&#20908;)</td> 
<td>Month 9</td> <td>Oct. 8 &ndash; Nov. 6</td></tr>
<tr><td>H&#224;i (&#x4EA5;)</td> <td>J10&ndash;J11 (&#31435;&#20908;&ndash;&#22823;&#38634;)</td> 
<td>Month 10</td> <td>Nov. 7 &ndash; Dec. 6</td></tr>
</table>
<br />
<p>Note that the dates of the 24 solar terms are almost the same in the Gregorian calendar. So the Gregorian dates of these months fluctuate by only about one day from year to year. However, the start and end days of the months in this system can fluctuate up to about 30 days in the Chinese calendar. This means that the months in this system do not in general coincide with the months in the Chinese calendar. When paired with the heavenly branches, the sexagenary months have a cycle of 60 months, or 5 su&#236;'s.</p>
    
<br />
<h2>Sexagenary Days</h2>
    
<p>Sexagenary days have a cycle of 60 days. Sexagenary numbers have been used to record dates in China for more than 2700 years. The system has not been interrupted and no mistakes have been made.</p>

<p>The sexagenary number of a day can be easily determined if we know the Julian day number, which is the number of days counting from noon on January 1, 4713 BCE. Hence Julian dates at noon are integers. A time zone is not specified here and it is assumed that the time origin (noon on January 1, 4713 BCE) and the time at noon on any day are both in the same time zone. There are algorithms to convert a Gregorian/Julian date to the Julian date (see e.g. <a href="https://en.wikipedia.org/wiki/Julian_day" target="_blank">Wikipedia</a>). I also created a web-based <a href="Julian.html">Julian and sexagenary date calculator</a>.</p>
    
<p>To calculate sexagenary dates from Julian dates, we only need to know the sexagenary date of a particular Julian date and then use modular arithmetic to derive a formula establishing the relationship between Julian dates and sexagenary dates. From the <a href="index.html?y=2019">2019 calendar</a>, we see that the sexagenary date of January 27, 2019 was ji&#462; z&#464; (the first sexagenary number). The Julian date of Jan 27, 2019 at noon was 2458511. Since sexagenary dates have a cycle of 60 days and mod(2458511, 60) = 11, it follows from modular arithmetic that</p>
<p>Sexagenary date number S = 1 + mod(JD<sub>noon</sub> - 11, 60) &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(1)</p>
<p>Here <span class="nowrap">JD<sub>noon</sub></span> is the Julian date at noon. Sexagenary number 1 refers to ji&#462; z&#464;, 2 refers y&#464; ch&#466;u, 3 refers to b&#464;ng y&#237;n and so on. That is, S refers to the numerical order of the sexagenary name listed in <a href="sexagenary.html#sexagenary">Table 2</a> above. If T denotes the numerical order of the stem name in <a href="sexagenary.html#stemsNbranches">Table 1</a> and B denotes the numerical order of the branch name in Table 1, they are related to S by</p>
<p>T = 1 + mod(S-1, 10),&nbsp;&nbsp; B = 1 + mod(S-1, 12). &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(2)</p>
<p>While the sexagenary number S was occasionally useful in some computation in ancient Chinese almanacs, it's mostly not needed. The values of T and B can be computed from <span class="nowrap">JD<sub>noon</sub></span> directly. The formulae can be derived from the fact that the sexagenary date of <span class="nowrap">JD<sub>noon</sub></span>=2458511 was ji&#462; z&#464; (T=1 and B=1). Since heavenly stems have a cycle of 10 days, earthly branches have a cycle of 12 days, mod(2458511, 10)=1 and mod(2458511, 12)=11, it follows that</p>
<p>T = 1 + mod(JD<sub>noon</sub>-1, 10),&nbsp;&nbsp; B = 1 + mod(JD<sub>noon</sub>+1, 12).&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(3)</p>
<p>Since we are using the base-10 system, T is simply the last digit in <span class="nowrap">JD<sub>noon</sub></span>, with the exception that T=10 if the last digit is 0. As an example, <span class="nowrap">JD<sub>noon</sub></span>=2371629 on March 13, 1781. We have T=9 and the stem name is r&#233;n; B = 1 + mod(2371630, 12) = 11 and the branch name is x&#363;. So the sexagenary day cycle was r&#233;n x&#363;.</p>
    
<p>As a side note, the days of week can also be calculated easily from <span class="nowrap">JD<sub>noon</sub></span>. Since Jan 27, 2019 was Sunday with <span class="nowrap">JD<sub>noon</sub></span>=2458511 and mod(2458511, 7)=6, it follows that the day of week of a day with <span class="nowrap">JD<sub>noon</sub></span> is given by</p>
<p>W = mod(JD<sub>noon</sub>+1, 7)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(4)</p>
<p>Here W=0 means Sunday, W=1 means Monday, ..., W=6 means Saturday. The days of week in the <a href="index.html">calendar page</a> are calculated using Equation (4).</p>
    
<p>As another side note, given the sexagenary number S, the stem number T and branch number B can be calculated easily using Equation (2). However, the inverse problem is not so easy. Given T and B, S has to be determined by solving the modular arithmetic equations</p>
<p>S &equiv; T (mod 10), &nbsp;&nbsp; S &equiv; B (mod 12).</p>
<p>Here &equiv; represents <i>congruence</i>. The above equations simply mean that S-T is divisible by 10 and S-B is divisible by 12. For those who are not familiar with modular arithmetic, it might not be easy for them to derive a general expression for S. For a specific pair of T and B, one can of course look up <a href="sexagenary.html#sexagenary">Table 2</a> to find the answer. If this is considered as "cheating", one may use the following formula instead:<sup><a href="sexagenary.html#fn1">[1]</a></sup></p>
<p>k = 6T - 5B, S = k if k&gt;0 and S = k + 60 if k&le;0.</p>
<p>It's also easy to prove that T-B must be an even number, k&gt;0 is equivalent to T&ge;B and k&le;0 is equivalent to T&lt;B.</p>
<p>Take the result r&#233;n x&#363; calculated above as an example. We have T=9 and B=11, so k=6&times;9-5&times;11=-1. We thus have S=59, which agrees with Table 2.</p> 
    
<p>The above modular arithmetic equations are not difficult. I haven't studied the theory of modular arithmetic formally, but I managed to derive the solution without difficulty. That's because it doesn't require the use of any sophisticated algorithm in modular arithmetic to solve the equations.<sup><a href="sexagenary.html#fn2">[2]</a></sup> A slightly harder question appeared in the book <i>Sunzi Suanjing</i> (《孫子算經》) written in the third century:</p> 
<blockquote>
There are an unknown number of things. The remainder is two when counted by threes, three when counted by five, and two when counted by seven. Find the unknown number.
</blockquote>
<p>Written in modern mathematical language, the equations for the unknown integer x are<sup><a href="sexagenary.html#fn3">[3]</a></sup></p>
<p>x &equiv; 2 (mod 3), &nbsp; x &equiv; 3 (mod 5), &nbsp; x &equiv; 2 (mod 7).</p>
<p>Almanac calculations in ancient China often involved modular arithmetic, especially the computation of the <a href="Shangyuan.html"><i>Sh&#224;ngyu&#225;n</i></a>. The <a href="https://en.wikipedia.org/wiki/Chinese_remainder_theorem" target="_blank">Chinese remainder theorem</a> was discovered and algorithms were constructed from the study of modular arithmetic problems in ancient China.</p>
<br />
    
<h2>Sexagenary Cycle for Time</h2>
    
<p>In the past, Chinese people divided a day into 12 (double) hours. So each (double) hour has a unique branch name. The z&#464; hour corresponds to the modern-day time period 23:00-1:00, ch&#466;u hour corresponds to 1:00-3:00, y&#237;n 3:00-5:00 and so on. More often only the branch names were used to specify the time in a day. When paired with the heavenly stems, the sexagenary hours have a cycle of 60 (double) hours or 5 days. As a result, the stem name of an hour and the stem name of a date are correlated in a similar way as the month and year described above. There is an analogous table for the relationship. However, I find it more convenient to just remember that the stem name of the z&#464; hour in a ji&#462; day is always ji&#462;. The stem name of any other hours can be deduced by counting the number of hours from a ji&#462; day. As an example, the w&#232;i hour (13:00-15:00) in a d&#299;ng day is the (8 + 12&times;3)th hour or 44th hour from a ji&#462; day, so its stem is the third stem from ji&#462;, which is d&#299;ng. So the sexagenary number is d&#299;ng w&#232;i.</p>
    <br /><hr>
<h2>Footnotes</h2>
<ul style="list-style-type:none;">

<li id="fn1"><p><span class="ref">[1]</span> It is easy to verify that the solution satisfies the equations in (2). First write</p> 
<p>S = 6T - 5B + 60n, where n=0 if T&ge;B and n=1 if T&lt;B.</p>
<p>We can write <span class="nowrap">B = T + 2j</span> for some integer j since T and B differ by an even number. Substituting <span class="nowrap">B = T + 2j</span> to the S expression gives</p>
<p>S = T - 10j + 60n.</p>
<p>Since both 10j and 60n are divisible by 10, </p>
<p>mod(S-1, 10) = mod(T-1, 10) = T - 1, which is the first equation in (2). The last equality holds because <span class="nowrap">T-1</span> is an integer between 0 and 9. Similarly, substituting <span class="nowrap">T = B - 2j</span> into the S expression gives</p>
<p>S = B - 12j + 60n. Since 12j and 60n are divisible by 12, </p>
<p>mod(S-1, 12) = mod(B-1, 12) = B - 1, which is the second equation in (2).</p>
</li>
    <br />
<li id="fn2"><p><span class="ref">[2]</span> Here is how I derive the expression. The modular arithmetic equations can be expressed as</p>
<p>S = T + 10i,&nbsp;&nbsp; S = B + 12j for some integers i and j.</p>
<p>&rArr; &nbsp; T + 10i = B + 12 j</p>
<p>&rArr; &nbsp; 6j - 5i = (T-B)/2.</p>
<p>Obviously i=j=(T-B)/2 is a solution. So</p>
<p>S = T + 10i = T + 5(T-B) = 6T - 5B, but the number is negative or 0 when T&lt;B, in which case 60 has to be added to it in order for S&in;[1,60].</p>
<p>The key step is to find two integers p and q that solve the equation <span class="nowrap">6p - 5q = 1</span>. If p and q are found, multiplying them by <span class="nowrap">(T-B)/2</span> will provide a solution for i and j. In this case, it's obvious that p=q=1 is a solution. If the equation were <span class="nowrap">ap - bq = 1</span> with other integers a and b, it might not be so easy to guess the solution. One will in general have to use the <a href="https://en.wikipedia.org/wiki/Extended_Euclidean_algorithm" target="_blank">extended Euclidean algorithm</a> to solve the equation.</p>
</li>
    <br />
<li id="fn3"><p><span class="ref">[3]</span> Consider more general equations:</p>
<p>x &equiv; a (mod 3), &nbsp; x &equiv; b (mod 5), &nbsp; x &equiv; c (mod 7),</p>
<p>with a&in;[0,2], b&in;[0,4] and c&in;[0,6], i.e. a, b, and c are the remainders of x divided by 3, 5 and 7, respectively. <i>Sunzi Suanjing</i> provides the following solution:</p>
<p>x = 70a + 21b + 15c - 105n, where n is an arbitrary integer.</p>
<p>The expression can be derived using the Chinese remainder theorem. However, it's relatively easy to verify that this solution indeed solves the equations. Since 21b, 15c and 105n are all divisible by 3, we have mod(x,3) = mod(70a, 3) = mod(3&times;23a+a,3) = mod(a,3)=a. Similar calculations give mod(x,5)=b and mod(x,7)=c.</p></li>
</ul>
<br /><br />
</div> <!-- end of wrapper -->
<script>
    // let heavenEng = ["Ji&#462;","Y&#464;","B&#464;ng","D&#299;ng","W&#249;", 
    //                   "J&#464;", "G&#275;ng","X&#299;n","R&#233;n", "Gu&#464;"];
    // let earthEng = ["z&#464;", "ch&#466;u", "y&#237;n", "m&#462;o", "ch&#233;n", 
    //                 "s&#236;", "w&#468;", "w&#232;i", "sh&#275;n", "y&#466;u", 
    //                 "x&#363;", "h&#224;i"];
    // let heavenChi = ["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"];
    // let earthChi = ["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"];
    // let txt = '<table>\n';
    // for (let i=0; i<15; i++) {
    //     txt += '<tr>\n';
    //     for (let j=0; j<4; j++) {
    //         let k = i+j*15;
    //         let ih = (k % 10), ie = (k % 12);
    //         //txt +='<td>'+(k+1)+'</td><td>'+heavenEng[ih]+' '+earthEng[ih]+' ('+heavenChi[ih]+earthChi[ie]+')</td>\n';
    //         txt += '<td>'+(k+1)+'</td><td>'+heavenChi[ih]+earthChi[ie]+'</td>\n';
    //     }
    //     txt += '</tr>\n';
    // }
    // txt += '</table>';
    // document.getElementById('sexagenaryTable').innerHTML = txt;
</script>
</body>
</html>